artifacts/logs/week11_cloud_k6_smoke_docker_run_seeded_authenticated_20260518_205831.log
===== seeded authenticated java preflight =====
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    15    0    15    0     0   1621      0 --:--:-- --:--:-- --:--:--  1666
HTTP/1.1 200 
X-Content-Type-Options: nosniff
X-XSS-Protection: 0
Cache-Control: no-cache, no-store, max-age=0, must-revalidate
Pragma: no-cache
Expires: 0
X-Frame-Options: DENY
Content-Type: application/vnd.spring-boot.actuator.v3+json
Transfer-Encoding: chunked
Date: Mon, 18 May 2026 12:58:31 GMT

{"status":"UP"}{
    "content": [
        {
            "id": "week11-k6-seed-created-001",
            "title": "Week11 K6 Seed Created Task",
            "mediaType": "video",
            "status": "CREATED",
            "createdAt": "2099-05-17T16:00:01Z"
        }
    ],
    "page": 0,
    "size": 5,
    "totalElements": 1,
    "status": "CREATED",
    "sort": "created_at_desc"
}

===== run seeded strict authenticated k6 =====

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6_smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 2 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 2 VUs  01.0s/30s

running (0m02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 2 VUs  02.0s/30s

running (0m03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  03.0s/30s

running (0m04.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 2 VUs  04.0s/30s

running (0m05.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  05.0s/30s

running (0m06.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  06.0s/30s

running (0m07.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  23% ] 2 VUs  07.0s/30s

running (0m08.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  08.0s/30s

running (0m09.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  09.0s/30s

running (0m10.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  10.0s/30s

running (0m11.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  11.0s/30s

running (0m12.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  12.0s/30s

running (0m13.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  43% ] 2 VUs  13.0s/30s

running (0m14.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  14.0s/30s

running (0m15.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  15.0s/30s

running (0m16.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  53% ] 2 VUs  16.0s/30s

running (0m17.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  17.0s/30s

running (0m18.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  18.0s/30s

running (0m19.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
default   [  63% ] 2 VUs  19.0s/30s

running (0m20.0s), 2/2 VUs, 34 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  20.0s/30s

running (0m21.0s), 2/2 VUs, 36 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  21.0s/30s

running (0m22.0s), 2/2 VUs, 38 complete and 0 interrupted iterations
default   [  73% ] 2 VUs  22.0s/30s

running (0m23.0s), 2/2 VUs, 40 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  23.0s/30s

running (0m24.0s), 2/2 VUs, 42 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  24.0s/30s

running (0m25.0s), 2/2 VUs, 44 complete and 0 interrupted iterations
default   [  83% ] 2 VUs  25.0s/30s

running (0m26.0s), 2/2 VUs, 45 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  26.0s/30s

running (0m27.0s), 2/2 VUs, 46 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  27.0s/30s

running (0m28.0s), 2/2 VUs, 48 complete and 0 interrupted iterations
default   [  93% ] 2 VUs  28.0s/30s

running (0m29.0s), 2/2 VUs, 50 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  29.0s/30s

running (0m30.0s), 2/2 VUs, 52 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  30.0s/30s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<750' p(95)=133.39ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 324     10.577792/s
    checks_succeeded...: 100.00% 324 out of 324
    checks_failed......: 0.00%   0 out of 324

    ✓ health status is 200
    ✓ health has body
    ✓ query status matches auth mode
    ✓ query does not return 5xx
    ✓ query json shape when 200
    ✓ query returns seeded task when authenticated

    HTTP
    http_req_duration..............: avg=64.41ms min=5.17ms med=50.01ms max=171.66ms p(90)=125.79ms p(95)=133.39ms
      { expected_response:true }...: avg=64.41ms min=5.17ms med=50.01ms max=171.66ms p(90)=125.79ms p(95)=133.39ms
    http_req_failed................: 0.00% 0 out of 108
    http_reqs......................: 108   3.525931/s

    EXECUTION
    iteration_duration.............: avg=1.13s   min=1.09s  med=1.12s   max=1.17s    p(90)=1.14s    p(95)=1.15s   
    iterations.....................: 54    1.762965/s
    vus............................: 2     min=2        max=2
    vus_max........................: 2     min=2        max=2

    NETWORK
    data_received..................: 47 kB 1.5 kB/s
    data_sent......................: 15 kB 502 B/s



running (0m30.6s), 0/2 VUs, 54 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  30s

===== summary check =====
-rw-r--r-- 1 GRT GRT 5.2K  5月 18 20:59 loadtest/reports/week11_k6_smoke_summary_docker_seeded_authenticated_20260518_205831.json

===== status =====
## main...origin/main
?? artifacts/logs/week11_cloud_k6_expected_status_patch_20260518_202712.log
?? artifacts/logs/week11_cloud_k6_seeded_query_patch_20260518_205824.log
?? artifacts/logs/week11_cloud_k6_smoke_create_20260518_175832.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_20260518_194612.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_after_proxy_fix_20260518_202057.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_authenticated_20260518_203332.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_expected_status_20260518_202718.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_seeded_authenticated_20260518_205831.log
?? artifacts/logs/week11_cloud_k6_smoke_docker_run_strict_authenticated_20260518_204625.log
?? artifacts/logs/week11_cloud_k6_smoke_run_20260518_192435.log
?? artifacts/logs/week11_cloud_k6_strict_auth_patch_20260518_204615.log
?? artifacts/logs/week11_docker_proxy_after_fix_20260518_202029.log
?? artifacts/logs/week11_docker_proxy_k6_pull_diag_20260518_195120.log
?? loadtest/