artifacts/logs/week11_k6_eval_artifact_link_20260520_164610.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6_eval_artifact_link.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✓ 'rate==1' rate=100.00%

    http_req_duration
    ✓ 'p(95)<200' p(95)=118.71ms

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6       48.465493/s
    checks_succeeded...: 100.00% 6 out of 6
    checks_failed......: 0.00%   0 out of 6

    ✓ status is 200
    ✓ content is array
    ✓ seed task is visible
    ✓ artifactUri is bound to mainbase bridge
    ✓ evalSummaryUri is bound to quality gate
    ✓ qualityGateStatus is PASS

    HTTP
    http_req_duration..............: avg=118.71ms min=118.71ms med=118.71ms max=118.71ms p(90)=118.71ms p(95)=118.71ms
      { expected_response:true }...: avg=118.71ms min=118.71ms med=118.71ms max=118.71ms p(90)=118.71ms p(95)=118.71ms
    http_req_failed................: 0.00% 0 out of 1
    http_reqs......................: 1     8.077582/s

    EXECUTION
    iteration_duration.............: avg=123.6ms  min=123.6ms  med=123.6ms  max=123.6ms  p(90)=123.6ms  p(95)=123.6ms 
    iterations.....................: 1     8.077582/s

    NETWORK
    data_received..................: 728 B 5.9 kB/s
    data_sent......................: 223 B 1.8 kB/s



running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 shared iters